app/controllers/cheers_controller.rb

SELECT "goals".* FROM "goals" WHERE "goals"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "cheers" ("created_at", "goal_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Fri, 22 Nov 2013 21:36:15 UTC +00:00], ["goal_id", 1], ["updated_at", Fri, 22 Nov 2013 21:36:15 UTC +00:00], ["user_id", 2]]
---
  def create
    goal = Goal.find(params[:goal_id])
    @cheer = Cheer.new(user_id: current_user.id, goal_id: goal.id)

    flash[:errors] = @cheer.errors.full_messages unless @cheer.save