app/controllers/goals_controller.rb

  def create
    @goal = current_user.goals.new(params[:goal])
    if @goal.save
---
INSERT INTO "goals" ("completed", "created_at", "name", "personal", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @goal = Goal.find(params[:id])
    if @goal.update_attributes(params[:goal])
---
SELECT "goals".* FROM "goals" WHERE "goals"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "goals" SET "name" = 'Changed name', "personal" = 't', "completed" = 't', "updated_at" = '2013-11-22 19:55:07.148934' WHERE "goals"."id" = 1

  def destroy
    Goal.find(params[:id]).destroy
---
DELETE FROM "goals" WHERE "goals"."id" = ?  [["id", 1]]
SELECT "goals".* FROM "goals" WHERE "goals"."id" = ? LIMIT 1  [["id", "1"]]