app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    if logged_in? && (@user.id == current_user.id)
      @goals = @user.goals
    else
      @goals = Goal.find_public_goals_by_user(@user)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "goals".* FROM "goals" WHERE "goals"."user_id" = 1

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("created_at", "password_digest", "session_token", "updated_at", "username") VALUES (?, ?, ?, ?, ?)

  def completed
    @user = User.find(params[:user_id])
    if logged_in? && (@user.id == current_user.id)
      @goals = @user.goals
    else
      @goals = Goal.find_public_goals_by_user(@user)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "goals".* FROM "goals" WHERE "goals"."user_id" = 1